package com.softigress.magicsigns._system.Utils;

public abstract class CensUtils {
    private static final int minLength = 6; // минимальная длина строки
    public static final int maxLength = 50; // максимальная длина строки

    private static final String[] regs = new String[] {
            "[a-zA-Zа-яА-Я]*[х|Хx|X]+[у|Уy|Y]+[e|Ее|Eи|Ий|Йя|Яё|Ё]+(?<!страху(е|я))[a-zA-Zа-яА-Я]*(?<!страхуй)",
            "[a-zA-Zа-яА-Я]*[х|Хx|X?]+[у|Уy|Y]+(ю|Ю)+[a-zA-Zа-яА-Я]*(?<!(л|Л)ихую|лохую|(т|Т)ихую|(г|Г)лухую|(с|С)ухую)",
            "[a-zA-Zа-яА-Я]*(б|Б)+(л|Л)+(я|Я)+(?<!(л|с|г)(а|о|у)бля|(д|р)(е|о)бля|грубля|орбля)[a-zA-Zа-яА-Я]*(?<!убля)",
            "[a-zA-Zа-яА-Я]*(б|Б)+(л|Л)+(я|Я)+(д|Д)+[a-zA-Zа-яА-Я]*",
            "[a-zA-Zа-яА-Я]*(м|Мm|M)+(у|Уy|Y)+(д|Д)+(?<!талмуд)[^рс][a-zA-Zа-яА-Я]*",
            "[a-zA-Zа-яА-Я]*(п|П)+[(и|И)(е|Е)(e|E)(ё|Ё)]+[(с|С)(c|C)(з|З)]+(д|Д)+[a-zA-Zа-яА-Я]*",
            "[a-zA-Zа-яА-Я]*(п|П)+(и|И)+(д|Д)+[(а|А)(a|A)(е|Е)(e|E)(о|О)(o|O)]+[(р|Р)(p|P)]+(?<!кипидар|(л|Л)апидар|(э|Э)пидер)[a-zA-Zа-яА-Я]*",
            "(?!(п|П)едикеб|(п|П)едикюр)[a-zA-Zа-яА-Я]*(п|П)+(е|Еe|E)+(д|Д)+(и|И)+[(к|К)(k|K)]+[a-zA-Zа-яА-Я]*",
            "[a-zA-Zа-яА-Я]*(п|П)+(и|И)+(д|Д)+(р|Рp|P)+(?<!спидр)[a-zA-Zа-яА-Я]*",
            "[a-zA-Zа-яА-Я]*(п|П)+(е|Еe|E)+(д|Д)+(р|Рp|P)+(и|И)+[a-zA-Zа-яА-Я]*",
            "[a-zA-Zа-яА-Я]*[(а|А)(a|A)(е|Е)(e|E)(о|О)(o|O)(и|И)(у|У)(y|Y)(ы|Ы)(ь|Ь)(ъ|Ъ)]+[(е|Е)(e|E)(ё|Ё)]+(б|Б)+[a-zA-Zа-яА-Я]*",
            "\\b[(е|Е)(e|E)(ё|Ё)]+(б|Б)+[a-zA-Zа-яА-Я]*",
            "[a-zA-Zа-яА-Я]*[(г|Г)r]+[(а|А)(a|A)(о|О)(o|O)]+[(в|В)B]+[(е|Е)(e|E)(ё|Ё)]*[(н|Н)H]+(?<!леговн|саговн|баговн)[a-zA-Zа-яА-Я]*"
    };

    public static String checkNameReg(String name) {
        if (name != null) {
            for (String reg : regs)
                name = name.replaceAll(reg, "***");
            return name.length() >= minLength ? name : null;
        }
        return null;
    }
}
